### 5. 인덱스 조작

In [1]:
import numpy as np
import pandas as pd

- 인덱스 설정 및 제거

In [2]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                            np.round(np.random.rand(3, 5), 2)]).T,
                columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [3]:
df2 = df1.set_index('C1')           # df1.set_index('C1',inplace=True)
df2

      C2    C3    C4
C1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [4]:
df1.index, df2.index

(RangeIndex(start=0, stop=5, step=1),
 Index(['A', 'B', 'C', 'D', 'E'], dtype='object', name='C1'))

In [5]:
df3 = df2.set_index('C2')
df3

        C3    C4
C2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

In [23]:
df_score1 = pd.DataFrame(np.random.randint(0, 101,size=(5,3)),columns=['국어','영어','수학'])
df_score1

   국어  영어  수학
0  98  42  77
1  21  73   0
2  10  43  58
3  23  59   2
4  98  62  35

In [26]:
df_score1.index = ['AAA','BBB','CCC','DDD','EEE']
# df_score1.index = [이름]
df_score1

     국어  영어  수학
AAA  98  42  77
BBB  21  73   0
CCC  10  43  58
DDD  23  59   2
EEE  98  62  35

In [22]:
df_score2 = df_score1.reset_index()
df_score2

  index  국어  영어  수학
0   AAA  49  69  41
1   BBB  35  64  95
2   CCC  69  94   0
3   DDD  50  36  34
4   EEE  48  93   3

In [28]:
df_score2.set_index('index',inplace=True)
df_score2

       국어  영어  수학
index
AAA    49  69  41
BBB    35  64  95
CCC    69  94   0
DDD    50  36  34
EEE    48  93   3

- 다중 인덱스

In [29]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [30]:
df3.columns.names = ['Cix1','Cix2']
df3

Cix1     A           B
Cix2    C1    C2    C1    C2
0     1.76  0.40  0.98  2.24
1     1.87 -0.98  0.95 -0.15
2    -0.10  0.41  0.14  1.45
3     0.76  0.12  0.44  0.33
4     1.49 -0.21  0.31 -0.85

In [31]:
df3['A','C1']

0    1.76
1    1.87
2   -0.10
3    0.76
4    1.49
Name: (A, C1), dtype: float64

In [32]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6, 4), 2),
                columns=[["A", "A", "B", "B"],
                            ["C", "D", "C", "D"]],
                index=[["M", "M", "M", "F", "F", "F"],
                          ["id_" + str(i + 1) for i in range(3)] * 2])
df4.columns.names = ["Cidx1", "Cidx2"]
df4.index.names = ["Ridx1", "Ridx2"]
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [34]:
df4['A','D']['M','id_3']

0.41

In [36]:
df4.iloc[2,1]

0.41

In [37]:
df4.iloc[2,1], df4.loc[('M','id_3'),('A','D')]

(0.41, 0.41)